/* --------------------------------------------------------------------------------- */
/* Пример example-g02n04.c                                                           */
/* Иллюстрация работы с функциями, реализующими кодирование/декодирование в base64   */
/* --------------------------------------------------------------------------------- */
 #include <stdio.h>
 #include <libakrypt.h>

 int main( void )
{
  int i = 0;
  char out[32];

 /* данные для преобразования в base64 и обратно */
  ak_uint8 in[22] =
    { 0x1a, 0x2b, 0x3c, 0x4d, 0xe5, 0xf6, 0x07, 0x18, 0x29, 0x30, 0x4a,
      0x5b, 0x6c, 0x7e, 0x8f, 0x91, 0xa2, 0xb3, 0xc4, 0xd5, 0xe6, 0x7f };

 /* основной цикл программы,
    перебирающий все значения длины входных данных от 1 до 22 */
  for( i = 0; i < 23; i++ ) {
    //size_t len = ak_base64_

  }




 return EXIT_FAILURE;
}
